## Plan Result (ptl_jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.rbac_admin[&#34;047fc0c7-abf4-405c-ac3f-5f1f9527c9e7&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;7fa5dd91-6812-42cc-a93f-377f7d4c9e1e&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;933c1e6e-7915-4ac9-aee2-f0a67ba626ae&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;98053eb3-8523-4c5a-96d3-c15532f87c19&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;c822a60c-d948-46f2-a4ce-b1c7ecd33f2f&#34;]
* Update
  * azurerm_key_vault_secret.logicappsecret
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment
* Delete
  * azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment)
  - resource "azurerm_cosmosdb_sql_role_assignment" "monitoring_mi_assignment" {
      - account_name        = "pipeline-metrics" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics/sqlRoleAssignments/b4011b16-62d0-739f-2d96-089c407cd4bb" -> null
      - name                = "b4011b16-62d0-739f-2d96-089c407cd4bb" -> null
      - principal_id        = "e28ed5a8-2b50-436b-a0ee-288491c9b51b" -> null
      - resource_group_name = "pipelinemetrics-database-prod" -> null
      - role_definition_id  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics" -> null
    }

  # azurerm_key_vault_secret.logicappsecret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "logicappsecret" {
        id                      = "https://cftptl-intsvc.vault.azure.net/secrets/github-jenkins-ptl-logicapp/9f479f27b69349ea956a3b864b214e9e"
        name                    = "github-jenkins-ptl-logicapp"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.rbac_admin["047fc0c7-abf4-405c-ac3f-5f1f9527c9e7"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "047fc0c7-abf4-405c-ac3f-5f1f9527c9e7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["7fa5dd91-6812-42cc-a93f-377f7d4c9e1e"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7fa5dd91-6812-42cc-a93f-377f7d4c9e1e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["933c1e6e-7915-4ac9-aee2-f0a67ba626ae"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "933c1e6e-7915-4ac9-aee2-f0a67ba626ae"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["98053eb3-8523-4c5a-96d3-c15532f87c19"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98053eb3-8523-4c5a-96d3-c15532f87c19"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["c822a60c-d948-46f2-a4ce-b1c7ecd33f2f"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c822a60c-d948-46f2-a4ce-b1c7ecd33f2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Logic/workflows/github-jenkins-cft-ptl"
        name                             = "github-jenkins-cft-ptl"
      ~ parameters                       = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
        tags                             = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      ~ workflow_parameters              = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                = "logic-app-deployment"
      ~ output_content      = jsonencode(
            {
              - callbackUrl = {
                  - type  = "String"
                  - value = "https://prod-13.uksouth.logic.azure.com:443/workflows/6dbd45e892a5401983aa1b29798de313/triggers/manual/paths/invoke?api-version=2017-07-01&sp=%2Ftriggers%2Fmanual%2Frun&sv=1.0&sig=x9WZiqvdbTeaD9XvNBW7pSJE-lKxKop5KcHKwdXnTc4"
                }
            }
        ) -> (known after apply)
      ~ parameters_content  = jsonencode(
          ~ {
              - rg                     = {
                  - value = ""
                }
              - servicebus_queue       = {
                  - value = "jenkins"
                }
                # (6 unchanged attributes hidden)
            }
        )
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"ptl_jenkins","Vars":{}} -->